Revit 2024 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs Property
 Structural Connection cannot replace elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }
Visual Basic
Public Shared ReadOnly Property StructuralConnectionCannotReplaceRefs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StructuralConnectionCannotReplaceRefs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace